import processing.net.*; //ネットワークライブラリの使用宣言

Server   myServer; //サーバのデータ構造
String[] SendMsg = new String[3]; //送信文字列の配列
String RecvMsg;  //受信メッセージ用文字列

//******************************************************************************
// 初期設定関数
//******************************************************************************
void setup( )
{
  size( 400, 200 );

  //日本語フォント(BIZ UDゴシック)で、サイズ16のフォントを生成
  PFont font = createFont("BIZ UDゴシック", 16, true);
  textFont(font); // 生成したフォントを設定

  //サーバの起動 (ポート番号は)
  myServer = new Server(this, 12345);

  SendMsg[0] = "100010010100101001010010101001010101";

  RecvMsg = ""; //メッセージの初期値
}

void stop( ){
  myServer.stop( );
}

void draw( ) // 画面描画(100ms毎に勝手に繰り返す)
{
  background(#086C52); // 緑に塗りつぶす．

  //左上にクライアントと自分のIPアドレスを表示
  text( "サーバー: " + myServer.ip(), 30, 20 );

  //受信文字列を表示
  text(RecvMsg, 30, 60 );
}

//******************************************************************************
// クライアント接続時に起動されるイベント
//******************************************************************************
void serverEvent( Server ConServer, Client ConClient )
{
  RecvMsg = "クライアント(" + ConClient.ip( ) + ")と接続";
}

//******************************************************************************
// マウスをクリックしたら起動されるイベント
//******************************************************************************
int numSendMsg = 0;
void mousePressed( )
{
  //サーバに文字列を送信

  myServer.write(SendMsg[numSendMsg]);

  println("送信: " + SendMsg[numSendMsg]);

  numSendMsg++;


  if( numSendMsg >= 3 ) numSendMsg = 0;
}
//*************************************************************************
//データを受信したら起動されるイベント(引数は送信先の情報)
//*************************************************************************
void clientEvent(Client c){

  int NumBytes = 0;

  NumBytes = c.available( ); //受信データがあるか確認

  if( NumBytes >= 1 ){ //受信データがあったら
    RecvMsg = c.readString(); //文字列を受信バッファから取り出す．
  }
}